Repository: google-code-export/miniemc2
Catalog: emc2-arm/src/po/*_axis.po
Languages: ru

source: Emergency stop
ru: Аварийная остановка

source: Turn machine on
ru: Включить станок

source: Activate first axis
ru: Активация первой оси

source: Activate second axis
ru: Активация второй оси

source: Activate third axis
ru: Активация третей оси

source: Activate fourth axis
ru: Активация четвертой оси

source: Activate fifth axis
ru: Активация пятой оси

source: Activate sixth axis
ru: Активация шестой оси

source: Set Feed Override from 0% to 100%
ru: Настройка лимита скорости от 0% до 100%

source: Increase jog speed
ru: Увеличение скорости

source: Decrease jog speed
ru: Уменьшение скорости

source: Select jog increment
ru: Выбор ускорения

source: Continuous jog
ru: Продолжить движение

source: Send active axis home
ru: Отправить активной оси на базу

source: Zero G54 offset for active axis
ru: Нулевой G54 компенсатор активной оси

source: Touch-off G54 offset for active axis
ru: Выключение G54 компенсатора активной оси

source: Jog first axis
ru: Движение первой оси

source: Jog second axis
ru: Движение второй оси

source: Jog third axis
ru: Движение третей оси

source: Jog fourth axis
ru: Движение четвертой оси

source: Left Button
ru: Левая кнопка мыши

source: Pan view or select line
ru: Просмотра или выбора линии

source: Shift+Left Button
ru: Shift+Левая кнопка мыши

source: Rotate view
ru: Вращение вида

source: Right Button
ru: Правая кнопка мыши

source: Zoom view
ru: Масштабирование вида

source: Wheel Button
ru: Третья кнопка мыши

source: Rotate Wheel
ru: Колёсико мыши

source: Manual control
ru: Ручное управление

source: Code entry (MDI)
ru: Код (MDI)

source: Override Limits
ru: Выход за пределы

source: Open program
ru: Открыть программу

source: Reload program
ru: Перегрузить программу

source: Run program
ru: Пуск программы

source: Step program
ru: Пошагово

source: Pause program
ru: Пауза

source: Resume program
ru: Возобновить программу

source: Stop program
ru: Стоп программы

source: Toggle mist
ru: Включение вентиляции

source: Toggle flood
ru: Включение охлаждения

source: Spindle brake off
ru: Остановить шпиндель

source: Spindle brake on
ru: Запустить шпиндель

source: Turn spindle clockwise
ru: Вращение шпинделя почасовой стрелки

source: Turn spindle counterclockwise
ru: Вращение шпинделя против часовой стрелки

source: Turn spindle more slowly
ru: Понизить скорость вращение шпинделя

source: Turn spindle more quickly
ru: Повысить скорости вращения шпинделя

source: Clear live plot
ru: Очистить пройденный путь

source: Cycle among preset views
ru: Цикл предыдущий вид

source: AXIS error
ru: Ошибка

source: No tool
ru: Нет инструмента

source: Unknown tool %d
ru: Не известный инструмент %d

source: Tool %d, offset %g, diameter %g
ru: Инструмент %d, отступ %g, диаметр %g

source: Program_filter %r failed
ru: Program_filter %r отсутствует

source: Exit code %d
ru: Код выхода %d

source: G-Code error in %s
ru: G-Код ошибка в %s

source: Near line %d of %s: %s
ru: Соответствие лини %d от %s: %s

source: Continuous
ru: Продолжить

source: Cancel
ru: Отменена

source: All machinable files
ru: Все поддерживаемые файлы

source: rs274ngc files
ru: rs274ngc файлы

source: All files
ru: Все файлы

source: Program exceeds machine minimum on axis %s
ru: Программа выходит за пределы минимума машины, по оси %s

source: Program exceeds machine maximum on axis %s
ru: Программа выходит за пределы максимума машины, по оси %s

source: Program exceeds machine limits
ru: Программа выходит за пределы машины

source: Run Anyway
ru: Выполнить еще раз

source: Touch Off
ru: Нажмите откл.

source: Touch off: Enter %s coordinate relative to workpiece
ru: Нажмите откл.: Введите %s относительные координаты изделия

source: Show EMC Status
ru: Показать EMC Статус

source: _Open
ru: _Открыть

source: _Reload
ru: _Перегрузить

source: _Quit
ru: _Выход

source: Toggle _Emergency Stop
ru: _Аварийная остановка

source: Toggle _Machine Power
ru: П_итание

source: Set _next line
ru: Установить _следующую строку

source: _Run program
ru: П_уск программы

source: _Step
ru: _Шаг

source: _Pause
ru: _Пауза

source: _Resume
ru: _Возобновить

source: S_top
ru: С_топ

source: _Calibration
ru: _Калибровка

source: Show _Hal Configuration
ru: Показать _Hal конфигурацию

source: Ha_l Scope
ru: Ha_l скоп

source: Sho_w EMC Status
ru: _Показать EMC Статус

source: _Top view
ru: Вид _сверху

source: _Rotated Top view
ru: Перевернутый вид с_верху

source: _Side view
ru: Вид с_боку

source: _Front view
ru: Вид с_переди

source: _Perspective view
ru: П_ерспектива

source: Display _Inches
ru: _Дюймы

source: Display _MM
ru: Ми_ллиметры

source: S_how program
ru: Показать п_рограмму

source: Sho_w live plot
ru: Показать текущую _операцию

source: Show too_l
ru: Показать _инструмент

source: Show e_xtents
ru: Показать р_азмеры

source: Show machine sp_eed
ru: Показать с_корость машины

source: _Clear live plot
ru: О_чистить пройденый путь

source: Show commanded position
ru: Показать позицию программы

source: Show actual position
ru: Показать фактическую позицию

source: Show machine position
ru: Показать позицию машины

source: Show relative position
ru: Показать относительную позицию

source: _About AXIS
ru: _О Axis

source: Quick _Reference
ru: Краткая _справка

source: _File
ru: _Файл

source: _Machine
ru: _Машина

source: _View
ru: _Вид

source: _Help
ru: _Справка

source: Toggle Emergency Stop [F1]
ru: Аварийная остановка [F1]

source: Toggle Machine power [F2]
ru: Питание [F2]

source: Open G-Code file [O]
ru: Открыть файл [0]

source: Reopen current file [Control-R]
ru: Перегрузить текущий файл [Control-R]

source: Begin executing current file [R]
ru: Начать исполнение текущего файла [R]

source: Execute next line [T]
ru: Выполнить следующую команду [T]

source: Pause [P] / resume [S] execution
ru: Пауза [P] / продолжить [S] исполнение

source: Stop program execution [ESC]
ru: Остановка исполнения программы [ESC]

source: Zoom in [+]
ru: Увеличить [+]

source: Zoom out [-]
ru: Уменьшить [-]

source: Top view
ru: Вид сверху

source: Rotated top view
ru: Перевернутый вид сверху

source: Side view
ru: Вид сбоку

source: Front view
ru: Вид спереди

source: Perspective view
ru: Перспектива

source: Clear live plot [Ctrl-K]
ru: Очистить пройденный путь [Ctrl-K]

source: Manual Control [F3]
ru: Ручное управление [F3]

source: Code Entry [F5]
ru: Добавить код [F5]

source: Axis:
ru: Ось:

source: Home
ru: База

source: Offset
ru: Отступ

source: Spindle:
ru: Шпиндель:

source: Stop
ru: Стоп

source: Brake
ru: Остановка

source: Coolant:
ru: Охлаждение:

source: Mist
ru: Вентиляция

source: Flood
ru: Охлаждение

source: History:
ru: История:

source: MDI Command:
ru: MDI Команда:

source: Go
ru: Выполнить

source: Active G-Codes:
ru: Активный G-Код:

source: Jog Speed:
ru: Скорость перемещения:

source: Feed Override:
ru: Лимит скорости:

source: About AXIS
ru: О AXIS

source: AXIS Quick Reference
ru: AXIS Быстрая справка

source: AXIS (No file)
ru: AXIS (Нет файла)

source: ESTOP
ru: Стоп

source: ESTOP RESET
ru: Готов

source: ON
ru: Вкл.

source: Machine
ru: Машина

source: Relative
ru: Случайный

source: Actual
ru: Текущий

source: Commanded
ru: Команда

source: Position:
ru: Позиция

source: Turn spindle counterclockwise [F10]
ru: Вращение шпинделя против часовой стрелке [F10]

source: Turn spindle clockwise [F9]
ru: Вращение шпинделя по часовой стрелке [F9]

source: Stop spindle [F9/F10]
ru: Стоп шпиндель [F9/F10]

source: Turn spindle Faster [F12]
ru: Вращение шпинделя быстрее [F12]

source: Turn spindle Slower [F11]
ru: Вращение шпинделя медленнее [F11]

source: Turn spindle brake on [Shift-B] or off [B]
ru: Вращение шпинделя вкл. [Shift-B] или откл.[B]

source: Turn flood on or off [F8]
ru: Охлаждение вкл. или откл.[F8]

source: Turn mist on or off [F7]
ru: Вентиляция вкл. или откл. [F7]

source: Send active axis home [Home]
ru: Отослать активную ось на базу [Home]

source: Set G54 offset for active axis [Shift-Home]
ru: Установить G54 отступ для активной оси [Shift-Home]

source: Activate axis [X]
ru: Активировать ось [X]

source: Activate axis [Y]
ru: Активировать ось [Y]

source: Activate axis [Z]
ru: Активировать ось [Z]

source: Activate axis [A]
ru: Активировать ось [A]

source: Activate axis [4]
ru: Активировать ось [4]

source: Activate axis [5]
ru: Активировать ось [5]

source: Jog selected axis
ru: Движение выбранной оси

source: Select jog ingrement
ru: Выбор движения

source: Temporarily allow jogging outside machine limits [L]
ru: Временно разрешить движение вне пределов машины [L]
