Repository: google-code-export/miniemc2
Catalog: emc2-arm/src/po/*_rs274_err.po
Languages: de

source: No error
de: Kein Fehler

source: A file is already open
de: Datei ist bereits geöffnet

source: All axes missing with g92
de: Keine Koordinaten für g92 angegeben

source: All axes missing with motion code
de: Keine Koordinaten für Wegbedingung angegeben

source: Arc radius too small to reach end point
de: Kreisradius zu klein zum Erreichen des Endpunktes

source: Argument to acos out of range
de: Argument acos außerhalb des gültigen Bereiches

source: Argument to asin out of range
de: Argument von asin außerhalb des gültigen Bereiches

source: Attempt to divide by zero
de: Versuch einer Division durch Null

source: Attempt to raise negative to non integer power
de: Versuch eine negative Zahl mit einem nicht-ganzzahligem Wert zu potenzieren

source: Bad character used
de: Ungültiges Zeichen benutzt

source: Bad format unsigned integer
de: Falsches Format bei vorzeichenloser Ganzzahl

source: Bad number format
de: Falsches Zahlenformat

source: Bug bad g code modal group 0
de: Fehler: Falscher G-Code in Modal-Gruppe 0

source: Bug code not g0 or g1
de: Fehler: Programm-Code ist nicht g0 oder g1

source: Bug code not g17 g18 or g19
de: Fehler: Programm-Code ist nicht g17, g18 oder g19

source: Bug code not g20 or g21
de: Fehler: Programm-Code ist nicht g20 oder g21

source: Bug code not g28 or g30
de: Fehler: Programm-Code ist nicht g28 oder g30

source: Bug code not g2 or g3
de: Fehler: Programm-Code ist nicht g2 oder g3

source: Bug code not g40 g41 or g42
de: Fehler: Programm-Code ist nicht g40, g41 oder g42

source: Bug code not g43 or g49
de: Fehler: Programm-Code ist nicht g43 oder g49

source: Bug code not g4 g10 g28 g30 g53 or g92 series
de: Fehler: Programm-Code ist nicht g4, g10, g28, g30, g53 oder g92-Serie

source: Bug code not g61 g61 1 or g64
de: Fehler: Programm-Code ist nicht g61, g61.1 oder g64

source: Bug code not g90 or g91
de: Fehler: Programm-Code ist nicht g90 oder g91

source: Bug code not g93 or g94
de: Fehler: Programm-Code ist nicht g93 oder g94

source: Bug code not g98 or g99
de: Fehler: Programm-Code ist nicht g98 oder g99

source: Bug code not in g92 series
de: Fehler: Programm-Code ist nicht aus g92-Serie

source: Bug code not in range g54 to g593
de: Fehler: Programm-Code ist nicht im Bereich g54 bis g593

source: Bug code not m0 m1 m2 m30 m60
de: Fehler: Programm-Code ist nicht m0, m1, m2, m30 oder m60

source: Bug distance mode not g90 or g91
de: Fehler: Maßangabe-Modus ist nicht g90 oder g91

source: Bug function should not have been called
de: Fehler: Funktion sollte besser nicht aufgerufen werden

source: Bug in tool radius comp
de: Fehler bei Werkzeugbahnkorrektur

source: Bug plane not xy yz or xz
de: Fehler: Fläche nicht in xy-, yz- oder xz-Ebene

source: Bug side not right or left
de: Fehler: Seite nicht rechts oder links

source: Bug unknown motion code
de: Fehler: Unbekannte Wegbedingung

source: Bug unknown operation
de: Fehler: Unbekannte Operation

source: Cannot change axis offsets with cutter radius comp
de: Der Offset einer Achse kann nicht geändert werden, wenn Werkzeugbahnkorrektur aktiv ist

source: Cannot change units with cutter radius comp
de: Die aktuelle verwendete Maßeinheit (Inch oder mm) kann nicht bei aktiver Werkzeugbahnkorrektur geändert werden

source: Cannot create backup file
de: Backup Datei kann nicht erzeugt werden.

source: Cannot do g1 with zero feed rate
de: G01 kann nicht mit einer Vorschubgeschwindigkeit von 0 ausgeführt werden

source: Cannot do zero repeats of cycle
de: Null Wiederholungen eines Zyklus

source: Cannot make arc with zero feed rate
de: Ein Kreisbogen mit einer Vorschubgeschwindigkeit von 0 ist nicht möglich

source: Cannot move rotary axes during probing
de: Rotations-Achse kann während einer Abtast-Fahrt nicht bewegt werden

source: Cannot open backup file
de: Kann Backup-Datei nicht öffnen

source: Cannot open variable file
de: Kann Variablen-Datei nicht öffnen

source: Cannot probe in inverse time feed mode
de: Abtast-Fahrten sind im zeitreziproken Vorschub-Modus nicht möglich

source: Cannot probe with cutter radius comp on
de: Abtast-Fahrten sind bei aktiver Werkzeugbahnkorrektur nicht möglich

source: Cannot probe with zero feed rate
de: Abtast-Fahrten mit einer Verfahrgeschwindigkeit von 0 sind nicht möglich

source: Cannot put a b in canned cycle
de: Angabe der Koordinaten-Wörter A und B in Arbeitszyklen ist nicht erlaubt

source: Cannot put a c in canned cycle
de: Angabe der Koordinaten-Wörter A und C in Arbeitszyklen ist nicht erlaubt

source: Cannot put an a in canned cycle
de: Angabe des Koordinaten-Wortes A in Arbeitszyklen ist nicht erlaubt

source: Cannot turn cutter radius comp on out of xy plane
de: Werkzeugbahnkorrektur funktioniert nur innerhalb der xy-Ebene

source: Cannot turn cutter radius comp on when on
de: Werkzeugbahnkorrektur kann nicht aktiviert werden wenn schon aktiv

source: Cannot use a word
de: Das Koordinaten-Wort A kann hier nicht verwendet werden

source: Cannot use axis values with g80
de: Keine Koordinaten-Angabe zusammen mit g80 möglich

source: Cannot use axis values without a g code that uses them
de: Koordinaten-Angaben können nur zusammen mit einer passenden Wegbedingung verwendet werden

source: Cannot use b word
de: Das Koordinaten-Wort B kann hier nicht verwendet werden

source: Cannot use c word
de: Das Koordinaten-Wort C kann hier nicht verwendet werden

source: Cannot use g28 or g30 with cutter radius comp
de: g28 oder g30 kann nicht mit aktiver Werkzeugbahnkorrektur verwendet werden

source: Cannot use g53 incremental
de: g53 kann nicht im inkrementalen Maßangabe-Modus benutzt werden

source: Cannot use g53 with cutter radius comp
de: g53 kann nicht mit aktiver Werkzeugbahnkorrektur verwendet werden

source: Cannot use two g codes that both use axis values
de: Es darf nur maximal eine Wegbedingung mit einer Koordinaten-Angabe pro Zeile verwendet werden

source: Cannot use xz plane with cutter radius comp
de: xz-Ebene kann nicht zusammen mit aktiver Werkzeugbahnkorrektur benutzt werden

source: Cannot use yz plane with cutter radius comp
de: yz-Ebene kann nicht zusammen mit aktiver Werkzeugbahnkorrektur benutzt werden

source: Command too long
de: Kommando zu lang

source: Concave corner with cutter radius comp
de: Konkave Ecke mit aktiver Werkzeugbahnkorrektur

source: Coordinate system index parameter 5220 out of range
de: Koordinaten-System Index-Parameter 5220 ausserhalb des gültigen Bereichs

source: Current point same as end point of arc
de: Aktueller Koordinaten-Punkt ist identisch mit dem Endpunkt des Kreisbogens

source: Cutter gouging with cutter radius comp
de: Konturverletzung bei Werkzeugbahnkorrektur

source: D word with no g41 or g42
de: Benutzung eines D-Wortes ohne Angabe von g41 oder g42

source: Dwell time missing with g4
de: Verweilzeit-Angabe fehlt bei g4

source: Dwell time p word missing with g82
de: Verweilzeit-Angabe durch P-Wort fehlt bei g82

source: Dwell time p word missing with g86
de: Verweilzeit-Angabe durch P-Wort fehlt bei g86

source: Dwell time p word missing with g88
de: Verweilzeit-Angabe durch P-Wort fehlt bei g88

source: Dwell time p word missing with g89
de: Verweilzeit-Angabe durch P-Wort fehlt bei g89

source: Equal sign missing in parameter setting
de: Gleichheitszeichen beim Setzen eines Parameters fehlt

source: F word missing with inverse time arc move
de: Angabe eines F-Wortes zum Fahren eines Kreisbogens im zeitreziproken Vorschub-Modus fehlt

source: F word missing with inverse time g1 move
de: Angabe eines F-Wortes zum Verfahren mit g1 im zeitreziproken Vorschub-Modus fehlt

source: File ended with no percent sign
de: Es fehlt ein Prozent-Zeichen am Ende der Datei

source: File ended with no percent sign or program end
de: Es fehlt ein Prozent-Zeichen oder ein Programm-Ende-Kommando am Ende der Datei

source: File name too long
de: Dateiname zu lang

source: File not open
de: Datei ist nicht offen

source: G code out of range
de: Wegbedingung außerhalb des erlaubten Bereiches

source: H word with no g43
de: Benutzung eines H-Wortes ohne g43

source: I word given for arc in yz plane
de: Angabe eines I-Wortes für einen Kreisbogen in der yz-Ebene

source: I word missing with g87
de: I-Wort fehlt bei g87

source: I word with no g2 or g3 or g87 to use it
de: Benutzung eines I-Wortes ohne zugehörige Angabe von g2, g3 oder g87

source: J word given for arc in xz plane
de: Angabe eines J-Wortes für einen Kreisbogen in der xz-Ebene

source: J word missing with g87
de: Es fehlt ein J-Wort für g87

source: J word with no g2 or g3 or g87 to use it
de: Benutzung eines J-Wortes ohne zugehörige Angabe von g2, g3 oder g87

source: K word given for arc in xy plane
de: Angabe eines K-Wortes für einen Kreisbogen in der xy-Ebene

source: K word missing with g87
de: Es fehlt ein J-Wort für g87

source: K word with no g2 or g3 or g87 to use it
de: Benutzung eines K-Wortes ohne zugehörige Angabe von g2, g3 oder g87

source: L word with no canned cycle or g10
de: Angabe eines L-Wortes ohne zugehörigen Arbeitszyklus oder g10

source: Left bracket missing after slash with atan
de: Fehlende linke Klammer nach Schrägstrich bei atan

source: Left bracket missing after unary operation name
de: Fehlende linke Klammer nach unärem Operationsnamen

source: Line number greater than 99999
de: Zeilennummer größer als 99999

source: Line with g10 does not have l2
de: Zeile mit G10 enthält kein L2

source: M code greater than 199
de: M-Kommando größer als 199

source: Mixed radius ijk format for arc
de: Radius- und IJK-Format durcheinandergewürfelt

source: Multiple a words on one line
de: Mehrere A-Worte in einer einzelnen Zeile

source: Multiple b words on one line
de: Mehrere B-Worte in einer einzelnen Zeile

source: Multiple c words on one line
de: Mehrere C-Worte in einer einzelnen Zeile

source: Multiple d words on one line
de: Mehrere D-Worte in einer einzelnen Zeile

source: Multiple f words on one line
de: Mehrere F-Worte in einer einzelnen Zeile

source: Multiple h words on one line
de: Mehrere H-Worte in einer einzelnen Zeile

source: Multiple i words on one line
de: Mehrere I-Worte in einer einzelnen Zeile

source: Multiple j words on one line
de: Mehrere J-Worte in einer einzelnen Zeile

source: Multiple k words on one line
de: Mehrere K-Worte in einer einzelnen Zeile

source: Multiple l words on one line
de: Mehrere L-Worte in einer einzelnen Zeile

source: Multiple p words on one line
de: Mehrere P-Worte in einer einzelnen Zeile

source: Multiple q words on one line
de: Mehrere Q-Worte in einer einzelnen Zeile

source: Multiple r words on one line
de: Mehrere R-Worte in einer einzelnen Zeile

source: Multiple s words on one line
de: Mehrere S-Worte in einer einzelnen Zeile

source: Multiple t words on one line
de: Mehrere T-Worte in einer einzelnen Zeile

source: Multiple x words on one line
de: Mehrere X-Worte in einer einzelnen Zeile

source: Multiple y words on one line
de: Mehrere Y-Worte in einer einzelnen Zeile

source: Multiple z words on one line
de: Mehrere Z-Worte in einer einzelnen Zeile

source: Must use g0 or g1 with g53
de: g53 muß immer zusammen mit g0 oder g1 genutzt werden

source: Negative argument to sqrt
de: Wurzel (sqrt-Kommando) mit negativem Argument

source: Negative d word tool radius index used
de: Negative Zahl bei bei D-Wort (Werkzeug-Radius als Index in der Werkzeug-Tabelle)

source: Negative f word used
de: F-Kommando mit negativer Zahl

source: Negative g code used
de: G-Wort mit negativer Zahl

source: Negative h word tool length offset index used
de: Negative Zahl bei bei H-Wort (Werkzeug-Länge als Index in der Werkzeug-Tabelle)

source: Negative l word used
de: L-Wort mit negativer Zahl

source: Negative m code used
de: M-Wort mit negativer Zahl

source: Negative or zero q value used
de: Q-Wert kleiner oder gleich Null

source: Negative p word used
de: P-Wort mit negativer Zahl

source: Negative spindle speed used
de: Geschwindigkeit der Werkzeug-Spindel kleiner Null

source: Negative tool id used
de: Negativer Werkzeugtabellen-Index verwendet

source: Nested comment found
de: Verschachtelter Kommentar entdeckt

source: No characters found in reading real value
de: Reelle Zahl erwartet, aber keinerlei Zeichen gefunden

source: No digits found where real number should be
de: Reelle Zahl erwartet, aber keinerlei Ziffern gefunden

source: Non integer value for integer
de: Angabe eines nicht-ganzzahligen Wertes, obwohl eine Ganzzahl erwartet wurde

source: Null missing after newline
de: Fehlende Null nach Zeilenschaltung

source: Offset index missing
de: Offset-Index fehlt

source: P value not an integer with g10 l2
de: P-Wert bei Verwendung von g10 l2 ist keine Ganzzahl

source: P value out of range with g10 l2
de: P-Wert ausserhalb des gültigen Bereichs bei g10 l2

source: P word with no g4 g10 g82 g86 g88 g89
de: Benutzung eines P-Wortes ohne zugehöriges Kommando g4, g10, g82, g86, g88 oder g89

source: Parameter file out of order
de: Parameter-Datei nicht in Ordnung

source: Parameter number out of range
de: Parameter-Nummer ausserhalb des gültigen Bereichs

source: Q word missing with g83
de: Q-Wort fehlt bei g83

source: Q word with no g83
de: Angabe eines Q-Wortes ohne g83

source: Queue is not empty after probing
de: Warteschlange ist nach Abtast-Fahrt nicht leer

source: R clearance plane unspecified in cycle
de: Angabe einer R-Abstands-Ebene für den Zklyus fehlt

source: R i j k words all missing for arc
de: Angabe von R, I, J oder K fehlt bei einem Kreisbogen

source: R less than x in cycle in yz plane
de: R ist kleiner als X während eines Zyklus in der YZ-Ebene

source: R less than y in cycle in xz plane
de: R ist kleiner als Y während eines Zyklus in der XZ-Ebene

source: R less than z in cycle in xy plane
de: R ist kleiner als Z während eines Zyklus in der XY-Ebene

source: R word with no g code that uses it
de: Koordinaten-Wort R ohne zugehörige Wegbedingung (g)

source: Radius to end of arc differs from radius to start
de: Radius zum Ende des Kreisbogens unterscheidet sich vom Radius am Start des Kreisbogens

source: Radius too small to reach end point
de: Radius zu klein zum Erreichen des Endpunktes

source: Required parameter missing
de: Benötigter Parameter fehlt

source: Selected tool slot number too large
de: Angegebene Werkzeug-Nummer zu groß

source: Slash missing after first atan argument
de: Fehlender Schrägstrich nach dem ersten Argument in einer atan-Funktion

source: Spindle not turning clockwise in g84
de: g84, aber Werkzeug-Spindel dreht sich nicht im Uhrzeigersinn

source: Spindle not turning in g86
de: g86, aber Werkzeug-Spindel nicht in Rotation

source: Spindle not turning in g87
de: g87, aber Werkzeug-Spindel nicht in Rotation

source: Spindle not turning in g88
de: g88, aber Werkzeug-Spindel nicht in Rotation

source: Sscanf failed
de: Fehler in Funktion sscanf()

source: Start point too close to probe point
de: Startpunkt zu dicht am Abtast-Punkt

source: Too many m codes on line
de: Zu viele M-Codes auf einer Zeile

source: Tool length offset index too big
de: Werkzeug-Längen-Index zu groß

source: Tool max too large
de: Werkzeug-Datei-Index zu groß

source: Tool radius index too big
de: Werkzeug-Tabellen-Index zu groß

source: Tool radius not less than arc radius with comp
de: Werkzeug-Radius bei der Werkzeugbahnkorrektur ist größer als der Kreisbogenradius

source: Two g codes used from same modal group
de: Benutzung von zwei G-Kommandos aus der selben modalen Gruppe in einer Zeile

source: Two m codes used from same modal group
de: Benutzung von zwei M-Kommandos aus der selben modalen Gruppe in einer Zeile

source: Unable to open file
de: Kann Datei nicht öffnen.

source: Unclosed comment found
de: Nicht abgeschlossener Kommentar

source: Unclosed expression
de: Nicht abgeschlossener Ausdruck

source: Unknown g code used
de: Unbekanntes G-Kommando

source: Unknown m code used
de: Unbekanntes M-Kommando

source: Unknown operation
de: Unbekannte Operation

source: Unknown operation name starting with a
de: Unbekannte Operation beginnend mit A

source: Unknown operation name starting with m
de: Unbekannte Operation beginnend mit M

source: Unknown operation name starting with o
de: Unbekannte Operation beginnend mit O

source: Unknown operation name starting with x
de: Unbekannte Operation beginnend mit X

source: Unknown word starting with a
de: Unbekanntes Wort beginnend mit A

source: Unknown word starting with c
de: Unbekanntes Wort beginnend mit C

source: Unknown word starting with e
de: Unbekanntes Wort beginnend mit E

source: Unknown word starting with f
de: Unbekanntes Wort beginnend mit F

source: Unknown word starting with l
de: Unbekanntes Wort beginnend mit L

source: Unknown word starting with r
de: Unbekanntes Wort beginnend mit R

source: Unknown word starting with s
de: Unbekanntes Wort beginnend mit S

source: Unknown word starting with t
de: Unbekanntes Wort beginnend mit T

source: Unknown word where unary operation could be
de: Unbekanntes Wort, wo unäre Operation erwartet

source: X and y words missing for arc in xy plane
de: X- und Y-Worte fehlen für einen Kreisbogen in der XY-Ebene

source: X and z words missing for arc in xz plane
de: X- und Z-Worte fehlen für einen Kreisbogen in der xz-Ebene

source: X value unspecified in yz plane canned cycle
de: Keine Angabe eines X-Wertes bei Arbeitszyklus in xz-Ebene

source: X y and z words all missing with g38 2
de: Keine Angabe eines X-, Y- und Z-Wortes bei g38 2

source: Y and z words missing for arc in yz plane
de: Y- und Z-Wort fehlen für Kreisbogen in der yz-Ebene

source: Y value unspecified in xz plane canned cycle
de: Keine Angabe eines Y-Wertes bei Arbeitszyklus in xz-Ebene

source: Z value unspecified in xy plane canned cycle
de: Keine Angabe eines Z-Wertes bei Arbeitszyklus in xy-Ebene

source: Zero or negative argument to ln
de: Argument der ln-Funktion kleiner oder gleich Null

source: Zero radius arc
de: Null Radius

source: The End
de: Ende

source: exceeds +X limit
de: überschreitet +X Limit

source: exceeds +Y limit
de: überschreitet +Y Limit

source: exceeds +Z limit
de: überschreitet +Z Limit

source: exceeds -X limit
de: überschreitet -X Limit

source: exceeds -Y limit
de: überschreitet -Y Limit

source: exceeds -Z limit
de: überschreitet -Z Limit

source: command (%s) cannot be executed until the machine is out of E-stop and turned on
de: Befehl (%s) kann nicht ausgefürt werden, bevor die Maschine aus dem E-Stop heraus ist und eingeschaltet ist

source: can't do that (%s) in manual mode
de: kann (%s) im manuellen Modus nicht ausführen

source: can't do that (%s) in auto mode with the interpreter idle
de: kann (%s) im automatischen Modus nicht ausführen, wenn der Interpreter stillsteht

source: can't do that (%s) in auto mode with the interpreter reading
de: kann (%s) im automatischen Modus nicht ausführen, wenn der Interpreter liest

source: can't do that (%s) in auto mode with the interpreter paused
de: kann (%s) im automatischen Modus nicht ausführen, wenn der Interpreter Pause macht

source: can't do that (%s) in auto mode with the interpreter waiting
de: kann (%s) im automatischen Modus nicht ausführen, wenn der Interpreter wartet

source: can't do that (%s) in MDI mode
de: kann (%s) im MDI-Modus nicht ausführen

source: can't open %s
de: kann %s nicht öffnen

source: Amplifier fault on axis %d.
de: Enstufen-Fehler der Achse %d.

source: Minimum Software Limit on axis %d exceeded.
de: Unteres Software-Limit der Achse %d ist erreicht.

source: Maximum Software Limit on axis %d exceeded.
de: Oberes Software-Limit der Achse %d ist erreicht.

source: Minimum Hardware Limit on axis %d exceeded.
de: Unteres Hardware-Limit der Achse %d ist erreicht.

source: Maximum Hardware Limit on axis %d exceeded.
de: Oberes Hardware-Limit der Achse %d ist erreicht.
